{
  "What services do you offer?": "We provide car rental services for daily, weekly, and monthly durations.",
  "How can I rent a car?": "You can rent a car by visiting our website or mobile app, selecting your desired vehicle, and completing the booking process.",
  "Do I need to register to rent a car?": "Yes, you need to create an account to rent a car and manage your bookings.",
  "What documents are required to rent a car?": "You need a valid driver’s license, an ID card or passport, and a credit or debit card for payment.",
  "What types of cars do you have available?": "We offer a wide range of cars, including sedans, SUVs, luxury cars, and economy models.",
  "What is the minimum age to rent a car?": "The minimum age to rent a car is 21 years. Drivers under 25 may incur an additional fee.",
  "Can I book a car in advance?": "Yes, you can book a car in advance through our platform.",
  "Do you offer insurance with the rental?": "Yes, we offer insurance coverage options with the car rental for added protection.",
  "Can I modify my booking?": "Yes, you can modify your booking through your account on our website or app.",
  "What is your cancellation policy?": "You can cancel your booking up to 24 hours before the pickup time without any charges.",
  "What are the payment options available?": "We accept payments via credit card, debit card, and online payment gateways.",
  "Do you offer corporate car rental services?": "Yes, we offer corporate car rental packages for businesses.",
  "Can I rent a car without a credit card?": "Currently, a credit card is required for security purposes during car rental.",
  "Are there any mileage limits?": "Yes, mileage limits vary depending on the rental plan. Additional charges may apply for excess mileage.",
  "Do you provide roadside assistance?": "Yes, 24/7 roadside assistance is available for all rentals.",
  "Can I return the car to a different location?": "Yes, we offer one-way rentals. Additional charges may apply.",
  "What happens if I return the car late?": "Late returns may incur additional charges. Please contact us if you anticipate a delay.",
  "Can I rent a car for someone else?": "Yes, but the driver must meet our rental requirements and provide the necessary documents.",
  "Do you have electric or hybrid cars?": "Yes, we offer a selection of electric and hybrid vehicles."
  }
